; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v4 ?v11)
             (pred_9 ?v2 ?v6)
             (pred_5 ?v4 ?v6)
             (pred_10 ?v13 ?v4 )
	     (pred_3 ?v4)
             (pred_7 ?v5)
             (pred_4 ?v2)
             (pred_8 ?v6)
             (pred_1 ?v4)
             (pred_12 ?v2)
             (pred_2 ?v4)
             (pred_11 ))



(:action op_2
:parameters (?v9 ?v12 ?v10 ?v1)
:precondition (and (pred_7 ?v9) (pred_7 ?v12) (pred_4 ?v10) (pred_8 ?v1)
          (pred_6 ?v9 ?v12) (pred_9 ?v10 ?v1)
                   (pred_5 ?v12 ?v1) (pred_3 ?v9) 
                   (pred_1 ?v12) (pred_12 ?v10))
:effect (and  (pred_2 ?v12) (not (pred_1 ?v12))))


(:action op_3
:parameters (?v9 ?v7)
:precondition (and (pred_7 ?v9) (pred_7 ?v7)
               (pred_3 ?v9) (pred_6 ?v9 ?v7) (pred_2 ?v7))
:effect (and (pred_3 ?v7) (not (pred_3 ?v9))))

(:action op_4
:parameters (?v9 ?v10)
:precondition (and (pred_7 ?v9) (pred_4 ?v10) 
                  (pred_3 ?v9) (pred_10 ?v10 ?v9) (pred_11 ))
:effect (and (pred_12 ?v10)
   (not (pred_10 ?v10 ?v9)) (not (pred_11 ))))


(:action op_5
:parameters (?v9 ?v8 ?v3)
:precondition (and (pred_7 ?v9) (pred_4 ?v8) (pred_4 ?v3)
                  (pred_3 ?v9) (pred_12 ?v3) (pred_10 ?v8 ?v9))
:effect (and (pred_12 ?v8) (pred_10 ?v3 ?v9)
        (not (pred_12 ?v3)) (not (pred_10 ?v8 ?v9))))

(:action op_1
:parameters (?v9 ?v10)
:precondition (and (pred_7 ?v9) (pred_4 ?v10) 
                  (pred_3 ?v9) (pred_12 ?v10))
:effect (and (pred_11 ) (pred_10 ?v10 ?v9) (not (pred_12 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_14 obj_08 obj_11 obj_04 obj_01 obj_07 obj_20 obj_03 obj_10 obj_16 obj_06 obj_21 obj_12 obj_17 obj_09
    obj_13 obj_15
    obj_05 obj_19 obj_18
    )

    (:init
       (pred_11)

       (pred_7 obj_02)
       (pred_7 obj_14)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_7 obj_04)
       (pred_7 obj_01)
       (pred_7 obj_07)
       (pred_7 obj_20)
       (pred_7 obj_03)
       (pred_7 obj_10)
       (pred_7 obj_16)
       (pred_7 obj_06)
       (pred_7 obj_21)
       (pred_7 obj_12)
       (pred_7 obj_17)
       (pred_7 obj_09)
       (pred_8 obj_13)
       (pred_8 obj_15)
       (pred_4 obj_05)
       (pred_4 obj_19)
       (pred_4 obj_18)

       (pred_6 obj_02 obj_04)
       (pred_6 obj_02 obj_14)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_02)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_08 obj_11)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_08)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_07)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_07 obj_16)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_07 obj_01)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_03 obj_21)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_10 obj_12)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_16 obj_07)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_06 obj_09)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_21 obj_12)
       (pred_6 obj_21 obj_03)
       (pred_6 obj_12 obj_17)
       (pred_6 obj_12 obj_10)
       (pred_6 obj_12 obj_21)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_17 obj_16)
       (pred_6 obj_17 obj_12)
       (pred_6 obj_09 obj_06)
       (pred_6 obj_09 obj_17)
       (pred_1 obj_21)
       (pred_1 obj_09)
       (pred_1 obj_12)
       (pred_5  obj_21 obj_13)
       (pred_5  obj_09 obj_15)
       (pred_5  obj_12 obj_13)
       (pred_2 obj_02)
       (pred_2 obj_14)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_2 obj_04)
       (pred_2 obj_01)
       (pred_2 obj_07)
       (pred_2 obj_20)
       (pred_2 obj_03)
       (pred_2 obj_10)
       (pred_2 obj_16)
       (pred_2 obj_06)
       (pred_2 obj_17)

       (pred_9  obj_05 obj_13)
       (pred_9  obj_19 obj_15)
       (pred_9  obj_18 obj_13)
       (pred_10 obj_05 obj_20)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_18 obj_14)
       (pred_3 obj_01)
    )

    (:goal (and
       (pred_10 obj_05 obj_07)
       (pred_10 obj_19 obj_10)
       (pred_10 obj_18 obj_11)
    ))
(:constraints
  (always (not (pred_3 obj_08)))
)
)

; plan
1. (op_3 obj_01 obj_07)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_07)
   goals met: 0 of 3
2. (op_3 obj_07 obj_20)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_20)
   goals met: 0 of 3
3. (op_4 obj_20 obj_05)
   deleted: (pred_10 obj_05 obj_20) (pred_11)
   added: (pred_12 obj_05)
   goals met: 0 of 3
4. (op_3 obj_20 obj_07)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_07)
   goals met: 0 of 3
5. (op_1 obj_07 obj_05)
   deleted: (pred_12 obj_05)
   added: (pred_11) (pred_10 obj_05 obj_07)
   goals met: 1 of 3
6. (op_3 obj_07 obj_01)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_01)
   goals met: 1 of 3
7. (op_3 obj_01 obj_14)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_14)
   goals met: 1 of 3
8. (op_4 obj_14 obj_18)
   deleted: (pred_10 obj_18 obj_14) (pred_11)
   added: (pred_12 obj_18)
   goals met: 1 of 3
9. (op_3 obj_14 obj_01)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_01)
   goals met: 1 of 3
10. (op_3 obj_01 obj_07)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_07)
   goals met: 1 of 3
11. (op_3 obj_07 obj_20)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_20)
   goals met: 1 of 3
12. (op_3 obj_20 obj_11)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_11)
   goals met: 1 of 3
13. (op_5 obj_11 obj_19 obj_18)
   deleted: (pred_12 obj_18) (pred_10 obj_19 obj_11)
   added: (pred_12 obj_19) (pred_10 obj_18 obj_11)
   goals met: 2 of 3
14. (op_3 obj_11 obj_20)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_20)
   goals met: 2 of 3
15. (op_3 obj_20 obj_07)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_07)
   goals met: 2 of 3
16. (op_3 obj_07 obj_01)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_01)
   goals met: 2 of 3
17. (op_3 obj_01 obj_10)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_10)
   goals met: 2 of 3
18. (op_1 obj_10 obj_19)
   deleted: (pred_12 obj_19)
   added: (pred_11) (pred_10 obj_19 obj_10)
   goals met: 3 of 3
